import string

# BA角色字典
BA_Role_Message = {
    # 角色攻略

    # 时
    '时':'时', '阿时':'时', 'toki':'时', 'Toki':'时', 'TOKI':'时', '季':'时', '高达':'时', '兔女郎时':'兔女郎时', '兔时':'兔女郎时', '兔Toki':'兔女郎时', '兔toki':'兔女郎时',
    # 渚
    '渚':'渚',
    # 爱莉
    '爱莉':'爱莉',
    # 朱音
    '朱音':'朱音', '茜':'朱音', '破甲女仆':'朱音', '兔女郎朱音':'兔女郎朱音', '兔朱音':'兔女郎朱音',  '白兔':'兔女郎朱音', '兔茜':'兔女郎朱音',
    # 亚伽里
    '亚伽里':'亚伽里', '明里':'亚伽里', '牛牛':'亚伽里',
    # 亚子
    '亚子':'亚子',
    # 爱丽丝
    '爱丽丝':'爱丽丝', '女仆装爱丽丝':'女仆装爱丽丝', '女仆爱丽丝':'女仆装爱丽丝', '女仆爱':'女仆装爱丽丝',
    # 阿露
    '阿露':'阿露', '社长':'阿露', '正月阿露':'正月阿露', '新春阿露':'正月阿露', '春露':'正月阿露',
    # 明日奈
    '明日奈':'明日奈', '亚丝娜':'明日奈', '兔女郎明日奈':'兔女郎明日奈', '兔女郎亚丝娜':'兔女郎明日奈', '兔明日奈':'兔女郎明日奈', '兔亚丝娜':'兔女郎明日奈', '蓝兔':'兔女郎明日奈',
    # 敦子
    '敦子':'敦子', '亚津子':'敦子', '公主':'敦子',
    # 绫音
    '绫音':'绫音', '凌音':'绫音', '泳装绫音':'泳装绫音', '泳装凌音':'泳装绫音', '直升机':'泳装绫音', '水着绫音':'泳装绫音',
    # 梓
    '梓':'梓', '泳装梓':'泳装梓', '水着梓':'泳装梓', '水梓':'泳装梓',
    # 切里诺
    '切里诺':'切里诺', '斯大萝':'切里诺', '雪萝':'切里诺', '温泉切里诺':'温泉切里诺', '温泉斯大萝':'温泉切里诺', '温萝':'温泉切里诺',
    # 千寻
    '千寻':'千寻',
    # 千夏
    '千夏':'千夏', '温泉千夏':'温泉千夏', '温泉夏':'温泉千夏',
    # 千世
    '千世':'千世', '泳装千世':'泳装千世', '水着千世':'泳装千世', '水千世':'泳装千世',
    # 艾米
    '艾米':'艾米', '英美':'艾米',
    # 吹雪
    '吹雪':'吹雪', '摆烂':'吹雪',
    # 枫香
    '枫香':'枫香', '煮饭婆':'枫香', '风華':'枫香', '正月枫香':'正月枫香', '正月煮饭婆':'正月枫香', '春风華':'正月枫香', '外卖婆':'正月枫香',
    # 花绘
    '花绘':'花绘', '大护士':'花绘', '圣诞花绘':'圣诞花绘', '圣诞大护士':'圣诞花绘', '圣大护士':'圣诞花绘',
    # 花子
    '花子':'花子', '泳装花子':'泳装花子', '水着花子':'泳装花子', '水花子':'泳装花子',
    # 晴
    '晴':'晴',
    # 遥香
    '遥香':'遥香', '德棍':'遥香', '春香':'正月遥香', '正月遥香':'正月遥香', '新春遥香':'正月遥香', '春遥':'正月遥香',
    # 羽留奈
    '羽留奈':'羽留奈', '晴奈':'羽留奈', '神秘狙':'羽留奈', '美食狙':'羽留奈', '正月羽留奈':'正月羽留奈', '新春羽留奈':'正月羽留奈', '新春狙':'正月羽留奈', '春晴奈':'正月羽留奈', '春奈':'正月羽留奈',
    # 莲实
    '莲实':'莲实', '莲见':'莲实', '体操服莲实':'体操服莲实', '运动服莲实':'体操服莲实', '体莲':'体操服莲实',
    # 初音未来
    '初音未来':'初音未来', '初音':'初音未来',
    # 响
    '响':'响', '拉拉响':'拉拉响', '拉响':'拉拉响', '应援团响':'拉拉响',
    # 日富美
    '日富美':'日富美', '浮士德':'日富美', '泳装日富美':'泳装日富美', '水着日富美':'泳装日富美', '水日富美':'泳装日富美',
    # 阳葵
    '阳葵':'阳葵', '日鞠':'阳葵', '轮椅':'阳葵',
    # 日奈
    '日奈':'日奈', '泳装日奈':'泳装日奈', '水着日奈':'泳装日奈', '水日奈':'泳装日奈',
    # 日向
    '日向':'日向',
    # 日和
    '日和':'日和',
    # 星野
    '星野':'星野', '大叔':'星野', '泳装星野':'泳装星野', '水着星野':'泳装星野', '水星野':'泳装星野', '泳装大叔':'泳装星野', '水着大叔':'泳装星野', '水大叔':'泳装星野',
    # 伊织
    '伊织':'伊织', '佐仓':'伊织', '泳装伊织':'泳装伊织', '水着伊织':'泳装伊织', '水伊织':'泳装伊织', '水佐仓':'泳装伊织',
    # 伊吕波
    '伊吕波':'伊吕波', '168':'伊吕波', '坦克':'伊吕波', '虎式':'伊吕波',
    # 泉
    '泉':'泉', '老八':'泉', '泳装泉':'泳装泉', '水着泉':'泳装泉', '水老八':'泳装泉',
    # 伊树莱
    '伊树莱':'伊树莱', '泉奈':'伊树莱', '小狐狸':'伊树莱', '忍忍':'伊树莱', '泳装伊树莱':'泳装伊树莱', '泳装泉奈':'泳装伊树莱', '水忍忍':'泳装伊树莱',
    # 淳子
    '淳子':'淳子', '纯子':'淳子', '丸子':'淳子', '正月淳子':'正月淳子', '新春淳子':'正月淳子',
    # 茱莉
    '茱莉':'茱莉', '朱莉':'茱莉',
    # 枫
    '枫':'枫',
    # 果穗
    '果穗':'果穗', '果惠':'果穗',
    # 叶渚
    '叶渚':'叶渚', '局长':'叶渚', '狂犬':'叶渚', '康纳':'叶渚',
    # 花凛
    '花凛':'花凛', '兔女郎花凛':'兔女郎花凛', '黑兔':'兔女郎花凛',
    # 佳代子
    '佳代子':'佳代子', '佳世子':'佳代子', '正月佳代子':'正月佳代子', '正月佳世子':'正月佳代子', '春佳':'正月佳代子',
    # 千纱
    '千纱':'千纱', '和纱':'千纱',
    # 桐乃
    '桐乃':'桐乃',
    # 小春
    '小春':'小春', '泳装小春':'泳装小春', '水着小春':'泳装小春', '水小春':'泳装小春',
    # 心奈
    '心奈':'心奈', '阿瑟':'心奈',
    # 小玉
    '小玉':'小玉',
    # 亚都梨
    '亚都梨':'亚都梨', '柯托莉':'亚都梨',
    # 小雪
    '小雪':'小雪',
    # 真纪
    '真纪':'真纪', '彩蛋':'真纪', 'Maki':'真纪', 'maki':'真纪',
    # 玛莉
    '玛莉':'玛莉', '玛丽':'玛莉', '体操服玛莉':'体操服玛莉', '体玛':'体操服玛莉',
    # 玛丽娜
    '玛丽娜':'玛丽娜', '保洁阿姨':'玛丽娜', '保洁':'玛丽娜',
    # 麻白
    '麻白':'麻白', '真白':'麻白', '泳装麻白':'泳装麻白', '泳装真白':'泳装麻白', '水真白':'泳装麻白', '水麻白':'泳装麻白',
    # 惠
    '惠':'惠', '喷火龙':'惠',
    # 三千留
    '三千留':'三千留', '满':'三千留', '小满':'三千留',
    # 绿
    '绿':'绿', '小绿':'绿',
    # 未花
    '未花':'未花', '三力':'未花', 'Mika':'未花', 'mika':'未花', 'MIKA':'未花', '弥香':'未花',
    # 三森
    '三森':'三森',
    # 南 
    '南':'南', '近卫南':'南', '发哥':'南',
    # 美祢 
    '美祢':'美祢', '团长':'美祢',
    # 美咲
    '美咲':'美咲', '円香':'美咲',
    # 宫子
    '宫子':'宫子', '都子':'宫子',
    # 美游
    '美游':'美游', '垃圾兔':'美游', '拉姬兔':'美游',
    # 萌惠
    '萌惠':'萌惠', '萌绘':'萌惠', '萌':'萌惠',
    # 桃井
    '桃井':'桃井', '小桃':'桃井',
    # 睦月
    '睦月':'睦月', '地雷妹':'睦月', '正月睦月':'正月睦月', '新春睦月':'正月睦月', '春睦':'正月睦月', '春月':'正月睦月',
    # 夏
    '夏':'夏', '小夏':'夏',
    # 宁瑠
    '宁瑠':'宁瑠', '尼禄':'宁瑠', '兔女郎尼禄':'兔女郎宁瑠', '兔女郎宁瑠':'兔女郎宁瑠', '红兔':'兔女郎宁瑠',
    # 诺亚
    '诺亚':'诺亚', '乃爱':'诺亚',
    # 和香
    '和香':'和香', '望远镜':'和香', '温泉和香':'温泉和香', '老板娘':'温泉和香',
    # 野乃美
    '野乃美':'野乃美', '富婆':'野乃美', 'NNM':'野乃美', '泳装野乃美':'泳装野乃美', '泳装富婆':'泳装野乃美', '水着富婆':'泳装野乃美', '水富婆':'泳装野乃美', '水乃美':'泳装野乃美',
    # 菲娜
    '菲娜':'菲娜', '不死鸟':'菲娜',
    # 玲纱
    '玲纱':'玲纱', '澪纱':'玲纱',
    # 瑠美 
    '瑠美':'瑠美', '炒饭':'瑠美',
    # 咲
    '咲':'咲', 'Saki':'咲', 'saki':'咲',
    # 樱子
    '樱子':'樱子',
    # 纱织
    '纱织':'纱织',
    # 沙耶
    '沙耶':'沙耶', '纱绫':'沙耶', '鼠鼠':'沙耶',
    # 濑奈
    '濑奈':'濑奈', '濑名':'濑奈', '救护车':'濑奈',
    # 芹香
    '芹香':'芹香', '黑猫':'芹香', '茜香':'芹香', '正月芹香':'正月芹香',
    # 芹奈
    '芹奈':'芹奈', '小护士':'芹奈', '圣诞芹奈':'圣诞芹奈', '圣诞小护士':'圣诞芹奈',
    # 时雨
    '时雨':'时雨',
    # 志美子
    '志美子':'志美子',
    # 白子
    '白子':'白子', '小仓唯':'白子', 'xcw':'白子', '单车白子':'单车白子', '车白':'单车白子',
    # 静子
    '静子':'静子', '泳装静子':'静子', '水着静子':'泳装静子', '水静子':'泳装静子',
    # 瞬
    '瞬':'瞬', '大瞬':'瞬', '旬':'瞬', '幼瞬':'幼瞬', '幼女瞬':'幼瞬',
    # 堇
    '堇':'堇', '运动妹':'堇',
    # 铃美
    '铃美':'铃美',
    # 巴
    '巴':'巴', '智惠':'巴',
    # 椿
    '椿':'椿', '狗盾':'椿',
    # 月夜
    '月夜':'月夜', '月咏':'月夜', '大忍':'月夜',
    # 弦生
    '弦生':'弦生', '鹤城':'弦生', '颜艺':'弦生', '泳装弦生':'泳装弦生', '泳装鹤城':'泳装弦生', '水弦生':'泳装弦生', '水鹤城':'泳装弦生', '水颜艺':'泳装弦生',
    # 忧
    '忧':'忧', 'UI':'忧',
    # 歌原
    '歌原':'歌原', '咏叶':'歌原', '炮台':'歌原', '啦啦队歌原':'啦啦队歌原', '啦啦队炮台':'啦啦队歌原', '拉拉炮':'啦啦队歌原',
    # 若藻
    '若藻':'若藻', '大狐狸':'若藻', '泳装若藻':'泳装若藻', '水若藻':'泳装若藻',
    # 好美
    '好美':'好美',
    # 优香
    '优香':'优香', '邮箱':'优香', '没包人':'优香', '体操服优香':'体操服优香', '体香':'体操服优香', '好有感觉':'体操服优香',
    # 柚子
    '柚子':'柚子', '女仆装柚子':'女仆装柚子', '女仆柚子':'女仆装柚子',
    }

# BA地图字典
BA_Map_Message = {
    '1-1':'1-1', '1-2':'1-2', '1-3':'1-3', '1-4':'1-4', '1-5':'1-5',
    '2-1':'2-1', '2-2':'2-2', '2-3':'2-3', '2-4':'2-4', '2-5':'2-5',
    '3-1':'3-1', '3-2':'3-2', '3-3':'3-3', '3-4':'3-4', '3-5':'3-5',
    '4-1':'4-1', '4-2':'4-2', '4-3':'4-3', '4-4':'4-4', '4-5':'4-5',
    '5-1':'5-1', '5-2':'5-2', '5-3':'5-3', '5-4':'5-4', '5-5':'5-5',
    '6-1':'6-1', '6-2':'6-2', '6-3':'6-3', '6-4':'6-4', '6-5':'6-5',
    '7-1':'7-1', '7-2':'7-2', '7-3':'7-3', '7-4':'7-4', '7-5':'7-5',
    '8-1':'8-1', '8-2':'8-2', '8-3':'8-3', '8-4':'8-4', '8-5':'8-5',
    '9-1':'9-1', '9-2':'9-2', '9-3':'9-3', '9-4':'9-4', '9-5':'9-5',
    '10-1':'10-1', '10-2':'10-2', '10-3':'10-3', '10-4':'10-4', '10-5':'10-5',
    '11-1':'11-1', '11-2':'11-2', '11-3':'11-3', '11-4':'11-4', '11-5':'11-5',
    '12-1':'12-1', '12-2':'12-2', '12-3':'12-3', '12-4':'12-4', '12-5':'12-5',
    '13-1':'13-1', '13-2':'13-2', '13-3':'13-3', '13-4':'13-4', '13-5':'13-5',
    '14-1':'14-1', '14-2':'14-2', '14-3':'14-3', '14-4':'14-4', '14-5':'14-5',
    '15-1':'15-1', '15-2':'15-2', '15-3':'15-3', '15-4':'15-4', '15-5':'15-5',
    '16-1':'16-1', '16-2':'16-2', '16-3':'16-3', '16-4':'16-4', '16-5':'16-5',
    '17-1':'17-1', '17-2':'17-2', '17-3':'17-3', '17-4':'17-4', '17-5':'17-5',
    '18-1':'18-1', '18-2':'18-2', '18-3':'18-3', '18-4':'18-4', '18-5':'18-5',
    '19-1':'19-1', '19-2':'19-2', '19-3':'19-3', '19-4':'19-4', '19-5':'19-5',
    '20-1':'20-1', '20-2':'20-2', '20-3':'20-3', '20-4':'20-4', '20-5':'20-5',
    '21-1':'21-1', '21-2':'21-2', '21-3':'21-3', '21-4':'21-4', '21-5':'21-5',
    '22-1':'22-1', '22-2':'22-2', '22-3':'22-3', '22-4':'22-4', '22-5':'22-5',
    '23-1':'23-1', '23-2':'23-2', '23-3':'23-3', '23-4':'23-4', '23-5':'23-5',
    'H1-1':'H1-1', 'H1-2':'H1-2', 'H1-3':'H1-3', 'H1-4':'H1-4', 'H1-5':'H1-5',
    'H2-1':'H2-1', 'H2-2':'H2-2', 'H2-3':'H2-3', 'H2-4':'H2-4', 'H2-5':'H2-5',
    'H3-1':'H3-1', 'H3-2':'H3-2', 'H3-3':'H3-3', 'H3-4':'H3-4', 'H3-5':'H3-5',
    'H4-1':'H4-1', 'H4-2':'H4-2', 'H4-3':'H4-3', 'H4-4':'H4-4', 'H4-5':'H4-5',
    'H5-1':'H5-1', 'H5-2':'H5-2', 'H5-3':'H5-3', 'H5-4':'H5-4', 'H5-5':'H5-5',
    'H6-1':'H6-1', 'H6-2':'H6-2', 'H6-3':'H6-3', 'H6-4':'H6-4', 'H6-5':'H6-5',
    'H7-1':'H7-1', 'H7-2':'H7-2', 'H7-3':'H7-3', 'H7-4':'H7-4', 'H7-5':'H7-5',
    'H8-1':'H8-1', 'H8-2':'H8-2', 'H8-3':'H8-3', 'H8-4':'H8-4', 'H8-5':'H8-5',
    'H9-1':'H9-1', 'H9-2':'H9-2', 'H9-3':'H9-3', 'H9-4':'H9-4', 'H9-5':'H9-5',
    'H10-1':'H10-1', 'H10-2':'H10-2', 'H10-3':'H10-3', 'H10-4':'H10-4', 'H10-5':'H10-5',
    'H11-1':'H11-1', 'H11-2':'H11-2', 'H11-3':'H11-3', 'H11-4':'H11-4', 'H11-5':'H11-5',
    'H12-1':'H12-1', 'H12-2':'H12-2', 'H12-3':'H12-3', 'H12-4':'H12-4', 'H12-5':'H12-5',
    'H13-1':'H13-1', 'H13-2':'H13-2', 'H13-3':'H13-3', 'H13-4':'H13-4', 'H13-5':'H13-5',
    'H14-1':'H14-1', 'H14-2':'H14-2', 'H14-3':'H14-3', 'H14-4':'H14-4', 'H14-5':'H14-5',
    'H15-1':'H15-1', 'H15-2':'H15-2', 'H15-3':'H15-3', 'H15-4':'H15-4', 'H15-5':'H15-5',
    'H16-1':'H16-1', 'H16-2':'H16-2', 'H16-3':'H16-3', 'H16-4':'H16-4', 'H16-5':'H16-5',
    'H17-1':'H17-1', 'H17-2':'H17-2', 'H17-3':'H17-3', 'H17-4':'H17-4', 'H17-5':'H17-5',
    'H18-1':'H18-1', 'H18-2':'H18-2', 'H18-3':'H18-3', 'H18-4':'H18-4', 'H18-5':'H18-5',
    'H19-1':'H19-1', 'H19-2':'H19-2', 'H19-3':'H19-3', 'H19-4':'H19-4', 'H19-5':'H19-5',
    'H20-1':'H20-1', 'H20-2':'H20-2', 'H20-3':'H20-3', 'H20-4':'H20-4', 'H20-5':'H20-5',
    'H21-1':'H21-1', 'H21-2':'H21-2', 'H21-3':'H21-3', 'H21-4':'H21-4', 'H21-5':'H21-5',
    'H22-1':'H22-1', 'H22-2':'H22-2', 'H22-3':'H22-3', 'H22-4':'H22-4', 'H22-5':'H22-5',
    'H23-1':'H23-1', 'H23-2':'H23-2', 'H23-3':'H23-3', 'H23-4':'H23-4', 'H23-5':'H23-5',
    }

# BA总力战与考试字典
BA_TBattle_Message = {
    # 因总力战特殊时间有效性，文件以时间区分

    #当期总力战
    '总力战':'当期总力', '总力':'当期总力',
    #当期考试
    '考试':'考试0815', '演习':'考试0815', '突破演习':'考试0815', 
    #霍德
    '霍德':'霍德', 'HOD':'霍德',
    #主教
    '主教':'主教', '耶罗尼姆斯':'主教',
    #黑白
    '黑白':'黑白', '黑&白':'黑白',
    #眼球
    '眼球':'眼球', '赫赛德':'眼球', '大眼':'眼球',
    #大蛇
    '大蛇':'大蛇', '薇娜':'大蛇',
    #寿司
    '凯坦泽':'寿司', '寿司':'寿司', '寿司超人':'寿司',
    #鸡斯拉
    '鸡斯拉':'鸡斯拉', '佩洛洛':'鸡斯拉', '佩洛洛吉拉':'鸡斯拉',
    #格里高利
    '格里高利':'格里高利', '教皇总力王':'格里高利', 
    #GOZ
    'GOZ':'GOZ', '戈兹':'GOZ', '狗子':'GOZ', 
    }

# BA活动字典
BA_Activity_Message = {
    #当期活动
    '活动':'当期活动',
    #卡池
    '卡池':'卡池', '卡池未来视':'卡池', '卡池规划':'卡池', 
    #存石
    '存石未来视':'存石', '存石':'存石', '存石规划':'存石', 
    #竞技场
    '竞技场':'竞技场', 'JJC':'竞技场', 'jjc':'竞技场', 
    #家具互动
    '家具互动':'家具互动', '互动家具':'家具互动', '特殊家具':'家具互动', 
    #家具制造
    '家具制造':'家具制造', '制造家具':'家具制造', 
    #制造
    '制造':'制造', '制造一览':'制造', 
    #礼物
    '礼物':'礼物', '送礼':'礼物', '礼品':'礼物', 
    #好感
    '好感':'好感', '羁绊':'好感', '摸头':'好感', 
    #角色简评
    '角色简评':'角色简评', '节奏榜':'角色简评', '角评':'角色简评', 
    #碎片刷取
    '碎片刷取':'碎片刷取', 'hard碎片刷取':'碎片刷取', '角色碎片':'碎片刷取', 
    # BUFF
    'BUFF':'BUFF', 'buff':'BUFF', 'buff详解':'BUFF', 'BUFF详解':'BUFF', 
    # 常见问题
    '常见问题':'常见问题', '入坑':'常见问题', '新手':'常见问题', '配队':'常见问题', '组队':'常见问题',
    # 初始
    '初始':'初始', '初始号':'初始', '初始刷取':'初始',
    # 装备刷取
    '装备刷取':'装备刷取', '装备':'装备刷取', '刷取装备':'装备刷取',
    # 氪金
    '氪金':'氪金', '氪金礼包':'氪金', '礼包':'氪金', '充值':'氪金',
    # 代币兑换
    '代币兑换':'代币兑换', '总力战代币':'代币兑换', 
    # 术语介绍
    '术语介绍':'术语介绍', '基本术语':'术语介绍', '术语':'术语介绍', 
    # 神名商店
    '神名商店':'神名商店', '母猪石':'神名商店',
    # 素材
    '素材':'素材', '材料':'素材', '欧帕兹':'素材',
    # 学生经验
    '学生经验':'学生经验', '学生经验需求':'学生经验',
    # 老师经验
    '老师经验':'老师经验', '老师经验需求':'老师经验',
    # 学院交流
    '学院交流':'学院交流', '学院交流会':'学院交流', '专武本':'学院交流', 




    }



class Blue_Archives():
    # 处理BA消息

    #轮询字典
    def Dict_polling(self, input_dict, msg):
        try:
            for userkey in input_dict.keys():
                if userkey in msg:
                    return input_dict[userkey]
        except:
            print('通用字典查询错误',flush=True)
        return None


    #角色
    def BA_Role(self, msg):
        try:
            msg_value = Blue_Archives().Dict_polling(BA_Role_Message, msg['msg'])  #轮询角色字典，下同
            if msg_value == None :
                print('非BA角色查询信息',flush=True)
                return None
            else:
                effective_information = '[CQ:image,file=BA攻略_' + msg_value + '.png]'
                return effective_information
        except:
            return None

    #地图
    def BA_Map(self, msg):
        try:
            msg_value = Blue_Archives().Dict_polling(BA_Map_Message, msg['msg']) 
            if msg_value == None :
                print('非BA地图查询信息',flush=True)
                return None
            else:
                effective_information = '[CQ:image,file=BA攻略_MAP_' + msg_value + '.png]'
                return effective_information
        except:
            return None

    #总力战与考试
    def BA_TBattle(self, msg):
        try:
            msg_value = Blue_Archives().Dict_polling(BA_TBattle_Message, msg['msg']) 
            if msg_value == None :
                print('非BA总力查询信息',flush=True)
                return None
            else:
                effective_information = '[CQ:image,file=BA攻略_TB_' + msg_value + '.png]'
                return effective_information
        except:
            return None

    #活动
    def BA_Activity(self, msg):
        try:
            msg_value = Blue_Archives().Dict_polling(BA_Activity_Message, msg['msg']) 
            if msg_value == None :
                print('非BA活动查询信息',flush=True)
                return None
            else:
                effective_information = '[CQ:image,file=BA攻略_AT_' + msg_value + '.png]'
                return effective_information
        except:
            return None


    #整体解析
    def BA_analysis(self, msg):
        Role_Or_Strategy = {
            'msg':str(msg['message']),
            'state':'unresolved'
            }
        try:
            push_information = Blue_Archives().BA_Role(Role_Or_Strategy)  #角色
            if push_information == None :
                pass
            else :
                msg['raw_message'] = msg['message'] = push_information
                return True
            
            push_information = Blue_Archives().BA_Map(Role_Or_Strategy)  #地图
            if push_information == None :
                pass
            else :
                msg['raw_message'] = msg['message'] = push_information
                return True

            push_information = Blue_Archives().BA_TBattle(Role_Or_Strategy)  #总力战
            if push_information == None :
                pass
            else :
                msg['raw_message'] = msg['message'] = push_information
                return True

            push_information = Blue_Archives().BA_Activity(Role_Or_Strategy)  #活动
            if push_information == None :
                pass
            else :
                msg['raw_message'] = msg['message'] = push_information
                return True

            #无效信息
            return False

        except:
            print('BA信息解析错误',flush=True)
            return False





